app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "London"], ["short_name", "Ld"], ["created_at", "2015-02-27 09:55:45.706591"], ["updated_at", "2015-02-27 09:55:45.706591"]]
---
  def create
    @city = City.new(city_params)
    @city.save